zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_flashctl.h
typedef struct {
  FLASHCTL_GEN_Regs  GEN;                               /* !< (@ 0x00000000) */
} FLASHCTL_Regs;

/*@}*/ /* end of group FLASHCTL */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* FLASHCTL 寄存器位域定义
******************************************************************************/

/* ---- 中断索引寄存器 (IIDX) ---- */
/* FLASHCTL_IIDX[STAT] - 中断状态索引 */
#define FLASHCTL_IIDX_STAT_OFS                   (0)                             /* !< STAT Offset */
#define FLASHCTL_IIDX_STAT_MASK                  ((uint32_t)0x00000001U)         /* !< Indicates which interrupt has
                                                                                    fired. 0x0 means no event pending.
                                                                                    The priority order is fixed. On each
                                                                                    read, only one interrupt is
                                                                                    indicated. On a read, the current
                                                                                    interrupt (highest priority) is
                                                                                    automatically cleared by the hardware
                                                                                    and the corresponding interrupt flags
                                                                                    in the RIS and MIS are cleared as
                                                                                    well. After a read from the CPU (not
                                                                                    from the debug interface), the
                                                                                    register must be updated with the
                                                                                    next highest priority interrupt. */
#define FLASHCTL_IIDX_STAT_NO_INTR               ((uint32_t)0x00000000U)         /* !< No Interrupt Pending */
#define FLASHCTL_IIDX_STAT_DONE                  ((uint32_t)0x00000001U)         /* !< DONE Interrupt Pending */

/* ---- 中断屏蔽寄存器 (IMASK) ---- */
/* FLASHCTL_IMASK[DONE] - Flash 操作完成中断屏蔽 */
#define FLASHCTL_IMASK_DONE_OFS                  (0)                             /* !< DONE Offset */
#define FLASHCTL_IMASK_DONE_MASK                 ((uint32_t)0x00000001U)         /* !< Interrupt mask for DONE: 0:
                                                                                    Interrupt is disabled in MIS register
                                                                                    1: Interrupt is enabled in MIS
                                                                                    register */
#define FLASHCTL_IMASK_DONE_DISABLED             ((uint32_t)0x00000000U)         /* !< Interrupt is masked out */
#define FLASHCTL_IMASK_DONE_ENABLED              ((uint32_t)0x00000001U)         /* !< Interrupt will request an interrupt
                                                                                    service routine and corresponding bit
                                                                                    in [IPSTANDARD.MIS] will be set */

/* ---- 原始中断状态寄存器 (RIS) ---- */
/* FLASHCTL_RIS[DONE] - Flash 操作完成原始中断状态 */
#define FLASHCTL_RIS_DONE_OFS                    (0)                             /* !< DONE Offset */
#define FLASHCTL_RIS_DONE_MASK                   ((uint32_t)0x00000001U)         /* !< Flash wrapper operation completed.
                                                                                    This interrupt bit is set by firmware
                                                                                    or the corresponding bit in the ISET
                                                                                    register. It is cleared by the
                                                                                    corresponding bit in in the ICLR
                                                                                    register or reading the IIDX register
                                                                                    when this interrupt is the highest
                                                                                    priority. */
#define FLASHCTL_RIS_DONE_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define FLASHCTL_RIS_DONE_SET                    ((uint32_t)0x00000001U)         /* !< Interrupt occurred */

/* ---- 屏蔽后中断状态寄存器 (MIS) ---- */
/* FLASHCTL_MIS[DONE] - Flash 操作完成屏蔽后中断状态 */
#define FLASHCTL_MIS_DONE_OFS                    (0)                             /* !< DONE Offset */
#define FLASHCTL_MIS_DONE_MASK                   ((uint32_t)0x00000001U)         /* !< Flash wrapper operation completed.
                                                                                    This masked interrupt bit reflects
                                                                                    the bitwise AND of the corresponding
                                                                                    RIS and IMASK bits. */
#define FLASHCTL_MIS_DONE_CLR                    ((uint32_t)0x00000000U)         /* !< Masked interrupt did not occur */
#define FLASHCTL_MIS_DONE_SET                    ((uint32_t)0x00000001U)         /* !< Masked interrupt occurred */

/* ---- 中断置位寄存器 (ISET) ---- */
/* FLASHCTL_ISET[DONE] - 置位 Flash 操作完成中断 */
#define FLASHCTL_ISET_DONE_OFS                   (0)                             /* !< DONE Offset */
#define FLASHCTL_ISET_DONE_MASK                  ((uint32_t)0x00000001U)         /* !< 0: No effect 1: Set the DONE
                                                                                    interrupt in the RIS register */
#define FLASHCTL_ISET_DONE_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define FLASHCTL_ISET_DONE_SET                   ((uint32_t)0x00000001U)         /* !< Set [IPSTANDARD.RIS] bit */

/* ---- 中断清除寄存器 (ICLR) ---- */
/* FLASHCTL_ICLR[DONE] - 清除 Flash 操作完成中断 */
#define FLASHCTL_ICLR_DONE_OFS                   (0)                             /* !< DONE Offset */
#define FLASHCTL_ICLR_DONE_MASK                  ((uint32_t)0x00000001U)         /* !< 0: No effect 1: Clear the DONE
                                                                                    interrupt in the RIS register */
#define FLASHCTL_ICLR_DONE_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define FLASHCTL_ICLR_DONE_CLR                   ((uint32_t)0x00000001U)         /* !< Clear [IPSTANDARD.RIS] bit */

/* ---- 事件模式寄存器 (EVT_MODE) ---- */
/* FLASHCTL_EVT_MODE[INT0_CFG] - 事件线模式选择 */
#define FLASHCTL_EVT_MODE_INT0_CFG_OFS           (0)                             /* !< INT0_CFG Offset */
#define FLASHCTL_EVT_MODE_INT0_CFG_MASK          ((uint32_t)0x00000003U)         /* !< Event line mode select for
                                                                                    peripheral event */
#define FLASHCTL_EVT_MODE_INT0_CFG_DISABLE       ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define FLASHCTL_EVT_MODE_INT0_CFG_SOFTWARE      ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define FLASHCTL_EVT_MODE_INT0_CFG_HARDWARE      ((uint32_t)0x00000002U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. Hardware must clear
                                                                                    the RIS. */

/* ---- 硬件版本描述寄存器 (DESC) ---- */
/* FLASHCTL_DESC[MINREV] - 次版本号 */
#define FLASHCTL_DESC_MINREV_OFS                 (0)                             /* !< MINREV Offset */
#define FLASHCTL_DESC_MINREV_MASK                ((uint32_t)0x0000000FU)         /* !< Minor Revision */
#define FLASHCTL_DESC_MINREV_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value */
#define FLASHCTL_DESC_MINREV_MAXIMUM             ((uint32_t)0x0000000FU)         /* !< Highest possible value */
/* FLASHCTL_DESC[MAJREV] Bits */
#define FLASHCTL_DESC_MAJREV_OFS                 (4)                             /* !< MAJREV Offset */
#define FLASHCTL_DESC_MAJREV_MASK                ((uint32_t)0x000000F0U)         /* !< Major Revision */
#define FLASHCTL_DESC_MAJREV_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value */
#define FLASHCTL_DESC_MAJREV_MAXIMUM             ((uint32_t)0x000000F0U)         /* !< Highest possible value */
/* FLASHCTL_DESC[INSTNUM] Bits */
#define FLASHCTL_DESC_INSTNUM_OFS                (8)                             /* !< INSTNUM Offset */
#define FLASHCTL_DESC_INSTNUM_MASK               ((uint32_t)0x00000F00U)         /* !< Instance number */
#define FLASHCTL_DESC_INSTNUM_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest value */
#define FLASHCTL_DESC_INSTNUM_MAXIMUM            ((uint32_t)0x00000F00U)         /* !< Highest possible value */
/* FLASHCTL_DESC[FEATUREVER] Bits */
#define FLASHCTL_DESC_FEATUREVER_OFS             (12)                            /* !< FEATUREVER Offset */
#define FLASHCTL_DESC_FEATUREVER_MASK            ((uint32_t)0x0000F000U)         /* !< Feature set */
#define FLASHCTL_DESC_FEATUREVER_MINIMUM         ((uint32_t)0x00000000U)         /* !< Minimum Value */
#define FLASHCTL_DESC_FEATUREVER_MAXIMUM         ((uint32_t)0x0000F000U)         /* !< Maximum Value */
/* FLASHCTL_DESC[MODULEID] Bits */
#define FLASHCTL_DESC_MODULEID_OFS               (16)                            /* !< MODULEID Offset */
#define FLASHCTL_DESC_MODULEID_MASK              ((uint32_t)0xFFFF0000U)         /* !< Module ID */
#define FLASHCTL_DESC_MODULEID_MINIMUM           ((uint32_t)0x00000000U)         /* !< Smallest value */
#define FLASHCTL_DESC_MODULEID_MAXIMUM           ((uint32_t)0xFFFF0000U)         /* !< Highest possible value */

/* ---- 命令执行寄存器 (CMDEXEC) ---- */
/* FLASHCTL_CMDEXEC[VAL] - 启动命令执行 */
#define FLASHCTL_CMDEXEC_VAL_OFS                 (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDEXEC_VAL_MASK                ((uint32_t)0x00000001U)         /* !< Command Execute value Initiates
                                                                                    execution of the command specified in
                                                                                    the CMDTYPE register. */
#define FLASHCTL_CMDEXEC_VAL_NOEXECUTE           ((uint32_t)0x00000000U)         /* !< Command will not execute or is not
                                                                                    executing in flash wrapper */
#define FLASHCTL_CMDEXEC_VAL_EXECUTE             ((uint32_t)0x00000001U)         /* !< Command will execute or is
                                                                                    executing in flash wrapper */

