zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_flashctl.h
/* FLASHCTL_CMDDATA2 Bits */
/* FLASHCTL_CMDDATA2[VAL] Bits */
#define FLASHCTL_CMDDATA2_VAL_OFS                (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA2_VAL_MASK               ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA2_VAL_MINIMUM            ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA2_VAL_MAXIMUM            ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDDATA3 Bits */
/* FLASHCTL_CMDDATA3[VAL] Bits */
#define FLASHCTL_CMDDATA3_VAL_OFS                (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA3_VAL_MASK               ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA3_VAL_MINIMUM            ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA3_VAL_MAXIMUM            ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDDATA4 Bits */
/* FLASHCTL_CMDDATA4[VAL] Bits */
#define FLASHCTL_CMDDATA4_VAL_OFS                (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA4_VAL_MASK               ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. T */
#define FLASHCTL_CMDDATA4_VAL_MINIMUM            ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA4_VAL_MAXIMUM            ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDDATA5 Bits */
/* FLASHCTL_CMDDATA5[VAL] Bits */
#define FLASHCTL_CMDDATA5_VAL_OFS                (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA5_VAL_MASK               ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA5_VAL_MINIMUM            ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA5_VAL_MAXIMUM            ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDDATA6 Bits */
/* FLASHCTL_CMDDATA6[VAL] Bits */
#define FLASHCTL_CMDDATA6_VAL_OFS                (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA6_VAL_MASK               ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA6_VAL_MINIMUM            ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA6_VAL_MAXIMUM            ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDDATA7 Bits */
/* FLASHCTL_CMDDATA7[VAL] Bits */
#define FLASHCTL_CMDDATA7_VAL_OFS                (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA7_VAL_MASK               ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA7_VAL_MINIMUM            ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA7_VAL_MAXIMUM            ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDDATA8 Bits */
/* FLASHCTL_CMDDATA8[VAL] Bits */
#define FLASHCTL_CMDDATA8_VAL_OFS                (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA8_VAL_MASK               ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA8_VAL_MINIMUM            ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA8_VAL_MAXIMUM            ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDDATA9 Bits */
/* FLASHCTL_CMDDATA9[VAL] Bits */
#define FLASHCTL_CMDDATA9_VAL_OFS                (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA9_VAL_MASK               ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA9_VAL_MINIMUM            ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA9_VAL_MAXIMUM            ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDDATA10 Bits */
/* FLASHCTL_CMDDATA10[VAL] Bits */
#define FLASHCTL_CMDDATA10_VAL_OFS               (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA10_VAL_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA10_VAL_MINIMUM           ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA10_VAL_MAXIMUM           ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDDATA11 Bits */
/* FLASHCTL_CMDDATA11[VAL] Bits */
#define FLASHCTL_CMDDATA11_VAL_OFS               (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA11_VAL_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA11_VAL_MINIMUM           ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA11_VAL_MAXIMUM           ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDDATA12 Bits */
/* FLASHCTL_CMDDATA12[VAL] Bits */
#define FLASHCTL_CMDDATA12_VAL_OFS               (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA12_VAL_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA12_VAL_MINIMUM           ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA12_VAL_MAXIMUM           ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDDATA13 Bits */
/* FLASHCTL_CMDDATA13[VAL] Bits */
#define FLASHCTL_CMDDATA13_VAL_OFS               (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA13_VAL_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA13_VAL_MINIMUM           ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA13_VAL_MAXIMUM           ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDDATA14 Bits */
/* FLASHCTL_CMDDATA14[VAL] Bits */
#define FLASHCTL_CMDDATA14_VAL_OFS               (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA14_VAL_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA14_VAL_MINIMUM           ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA14_VAL_MAXIMUM           ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

