zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_flashctl.h
/* FLASHCTL_CMDDATA15 Bits */
/* FLASHCTL_CMDDATA15[VAL] Bits */
#define FLASHCTL_CMDDATA15_VAL_OFS               (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA15_VAL_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA15_VAL_MINIMUM           ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA15_VAL_MAXIMUM           ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDDATA16 Bits */
/* FLASHCTL_CMDDATA16[VAL] Bits */
#define FLASHCTL_CMDDATA16_VAL_OFS               (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA16_VAL_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA16_VAL_MINIMUM           ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA16_VAL_MAXIMUM           ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDDATA17 Bits */
/* FLASHCTL_CMDDATA17[VAL] Bits */
#define FLASHCTL_CMDDATA17_VAL_OFS               (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA17_VAL_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA17_VAL_MINIMUM           ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA17_VAL_MAXIMUM           ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDDATA18 Bits */
/* FLASHCTL_CMDDATA18[VAL] Bits */
#define FLASHCTL_CMDDATA18_VAL_OFS               (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA18_VAL_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA18_VAL_MINIMUM           ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA18_VAL_MAXIMUM           ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDDATA19 Bits */
/* FLASHCTL_CMDDATA19[VAL] Bits */
#define FLASHCTL_CMDDATA19_VAL_OFS               (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA19_VAL_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA19_VAL_MINIMUM           ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA19_VAL_MAXIMUM           ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDDATA20 Bits */
/* FLASHCTL_CMDDATA20[VAL] Bits */
#define FLASHCTL_CMDDATA20_VAL_OFS               (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA20_VAL_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA20_VAL_MINIMUM           ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA20_VAL_MAXIMUM           ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDDATA21 Bits */
/* FLASHCTL_CMDDATA21[VAL] Bits */
#define FLASHCTL_CMDDATA21_VAL_OFS               (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA21_VAL_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA21_VAL_MINIMUM           ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA21_VAL_MAXIMUM           ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDDATA22 Bits */
/* FLASHCTL_CMDDATA22[VAL] Bits */
#define FLASHCTL_CMDDATA22_VAL_OFS               (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA22_VAL_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA22_VAL_MINIMUM           ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA22_VAL_MAXIMUM           ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDDATA23 Bits */
/* FLASHCTL_CMDDATA23[VAL] Bits */
#define FLASHCTL_CMDDATA23_VAL_OFS               (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA23_VAL_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA23_VAL_MINIMUM           ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA23_VAL_MAXIMUM           ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDDATA24 Bits */
/* FLASHCTL_CMDDATA24[VAL] Bits */
#define FLASHCTL_CMDDATA24_VAL_OFS               (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA24_VAL_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA24_VAL_MINIMUM           ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA24_VAL_MAXIMUM           ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDDATA25 Bits */
/* FLASHCTL_CMDDATA25[VAL] Bits */
#define FLASHCTL_CMDDATA25_VAL_OFS               (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA25_VAL_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA25_VAL_MINIMUM           ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA25_VAL_MAXIMUM           ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDDATA26 Bits */
/* FLASHCTL_CMDDATA26[VAL] Bits */
#define FLASHCTL_CMDDATA26_VAL_OFS               (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA26_VAL_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA26_VAL_MINIMUM           ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA26_VAL_MAXIMUM           ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDDATA27 Bits */
/* FLASHCTL_CMDDATA27[VAL] Bits */
#define FLASHCTL_CMDDATA27_VAL_OFS               (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDDATA27_VAL_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< A 32-bit data value is placed in
                                                                                    this field. */
#define FLASHCTL_CMDDATA27_VAL_MINIMUM           ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDDATA27_VAL_MAXIMUM           ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

