zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_flashctl.h
/* ---- 命令配置寄存器 (CFGCMD) ---- */
/* FLASHCTL_CFGCMD[WAITSTATE] - 校验读等待周期设置 */
#define FLASHCTL_CFGCMD_WAITSTATE_OFS            (0)                             /* !< WAITSTATE Offset */
#define FLASHCTL_CFGCMD_WAITSTATE_MASK           ((uint32_t)0x0000000FU)         /* !< Wait State setting for verify reads */
#define FLASHCTL_CFGCMD_WAITSTATE_MINIMUM        ((uint32_t)0x00000000U)         /* !< Minimum value */
#define FLASHCTL_CFGCMD_WAITSTATE_MAXIMUM        ((uint32_t)0x0000000FU)         /* !< Maximum value */

/* ---- 脉冲计数配置寄存器 (CFGPCNT) ---- */
/* FLASHCTL_CFGPCNT[MAXPCNTOVR] - 覆盖硬件最大脉冲计数 */
#define FLASHCTL_CFGPCNT_MAXPCNTOVR_OFS          (0)                             /* !< MAXPCNTOVR Offset */
#define FLASHCTL_CFGPCNT_MAXPCNTOVR_MASK         ((uint32_t)0x00000001U)         /* !< Override hard-wired maximum pulse
                                                                                    count.  If MAXERSPCNTOVR is not set,
                                                                                    then setting this value alone will
                                                                                    override the max pulse count for both
                                                                                    program and erase.  If MAXERSPCNTOVR
                                                                                    is set, then this bit will only
                                                                                    control the max pulse count setting
                                                                                    for program. By default, this bit is
                                                                                    0, and a hard-wired max pulse count
                                                                                    is used. */
#define FLASHCTL_CFGPCNT_MAXPCNTOVR_DEFAULT      ((uint32_t)0x00000000U)         /* !< Use hard-wired (default) value for
                                                                                    maximum pulse count */
#define FLASHCTL_CFGPCNT_MAXPCNTOVR_OVERRIDE     ((uint32_t)0x00000001U)         /* !< Use value from MAXPCNTVAL field as
                                                                                    maximum puse count */
/* FLASHCTL_CFGPCNT[MAXPCNTVAL] Bits */
#define FLASHCTL_CFGPCNT_MAXPCNTVAL_OFS          (4)                             /* !< MAXPCNTVAL Offset */
#define FLASHCTL_CFGPCNT_MAXPCNTVAL_MASK         ((uint32_t)0x00000FF0U)         /* !< Override maximum pulse counter with
                                                                                    this value.   If MAXPCNTOVR = 0, then
                                                                                    this field is ignored. If MAXPCNTOVR
                                                                                    = 1 and MAXERSPCNTOVR = 0, then this
                                                                                    value will be used  to override the
                                                                                    max pulse count for both program and
                                                                                    erase.  Full max value will be {4'h0,
                                                                                    MAXPCNTVAL} . If MAXPCNTOVR = 1 and
                                                                                    MAXERSPCNTOVR = 1, then this value
                                                                                    will be used to override the max
                                                                                    pulse count for program only.  Full
                                                                                    max value will be {4'h0, MAXPCNTVAL}. */
#define FLASHCTL_CFGPCNT_MAXPCNTVAL_MINIMUM      ((uint32_t)0x00000000U)         /* !< Minimum value */
#define FLASHCTL_CFGPCNT_MAXPCNTVAL_MAXIMUM      ((uint32_t)0x00000FF0U)         /* !< Maximum value */

/* ---- 命令状态寄存器 (STATCMD) ---- */
/* FLASHCTL_STATCMD[CMDDONE] - 命令完成状态 */
#define FLASHCTL_STATCMD_CMDDONE_OFS             (0)                             /* !< CMDDONE Offset */
#define FLASHCTL_STATCMD_CMDDONE_MASK            ((uint32_t)0x00000001U)         /* !< Command Done */
#define FLASHCTL_STATCMD_CMDDONE_STATNOTDONE     ((uint32_t)0x00000000U)         /* !< Not Done */
#define FLASHCTL_STATCMD_CMDDONE_STATDONE        ((uint32_t)0x00000001U)         /* !< Done */
/* FLASHCTL_STATCMD[CMDPASS] Bits */
#define FLASHCTL_STATCMD_CMDPASS_OFS             (1)                             /* !< CMDPASS Offset */
#define FLASHCTL_STATCMD_CMDPASS_MASK            ((uint32_t)0x00000002U)         /* !< Command Pass - valid when CMD_DONE
                                                                                    field is 1 */
#define FLASHCTL_STATCMD_CMDPASS_STATFAIL        ((uint32_t)0x00000000U)         /* !< Fail */
#define FLASHCTL_STATCMD_CMDPASS_STATPASS        ((uint32_t)0x00000002U)         /* !< Pass */
/* FLASHCTL_STATCMD[CMDINPROGRESS] Bits */
#define FLASHCTL_STATCMD_CMDINPROGRESS_OFS       (2)                             /* !< CMDINPROGRESS Offset */
#define FLASHCTL_STATCMD_CMDINPROGRESS_MASK      ((uint32_t)0x00000004U)         /* !< Command In Progress */
#define FLASHCTL_STATCMD_CMDINPROGRESS_STATCOMPLETE ((uint32_t)0x00000000U)         /* !< Complete */
#define FLASHCTL_STATCMD_CMDINPROGRESS_STATINPROGRESS ((uint32_t)0x00000004U)         /* !< In Progress */
/* FLASHCTL_STATCMD[FAILWEPROT] Bits */
#define FLASHCTL_STATCMD_FAILWEPROT_OFS          (4)                             /* !< FAILWEPROT Offset */
#define FLASHCTL_STATCMD_FAILWEPROT_MASK         ((uint32_t)0x00000010U)         /* !< Command failed due to Write/Erase
                                                                                    Protect Sector Violation */
#define FLASHCTL_STATCMD_FAILWEPROT_STATNOFAIL   ((uint32_t)0x00000000U)         /* !< No Fail */
#define FLASHCTL_STATCMD_FAILWEPROT_STATFAIL     ((uint32_t)0x00000010U)         /* !< Fail */
/* FLASHCTL_STATCMD[FAILVERIFY] Bits */
#define FLASHCTL_STATCMD_FAILVERIFY_OFS          (5)                             /* !< FAILVERIFY Offset */
#define FLASHCTL_STATCMD_FAILVERIFY_MASK         ((uint32_t)0x00000020U)         /* !< Command failed due to verify error */
#define FLASHCTL_STATCMD_FAILVERIFY_STATNOFAIL   ((uint32_t)0x00000000U)         /* !< No Fail */
#define FLASHCTL_STATCMD_FAILVERIFY_STATFAIL     ((uint32_t)0x00000020U)         /* !< Fail */
/* FLASHCTL_STATCMD[FAILMISC] Bits */
#define FLASHCTL_STATCMD_FAILMISC_OFS            (12)                            /* !< FAILMISC Offset */
#define FLASHCTL_STATCMD_FAILMISC_MASK           ((uint32_t)0x00001000U)         /* !< Command failed due to error other
                                                                                    than write/erase protect violation or
                                                                                    verify error.  This is an extra bit
                                                                                    in case a new failure mechanism is
                                                                                    added which requires a status bit. */
#define FLASHCTL_STATCMD_FAILMISC_STATNOFAIL     ((uint32_t)0x00000000U)         /* !< No Fail */
#define FLASHCTL_STATCMD_FAILMISC_STATFAIL       ((uint32_t)0x00001000U)         /* !< Fail */
/* FLASHCTL_STATCMD[FAILILLADDR] Bits */
#define FLASHCTL_STATCMD_FAILILLADDR_OFS         (6)                             /* !< FAILILLADDR Offset */
#define FLASHCTL_STATCMD_FAILILLADDR_MASK        ((uint32_t)0x00000040U)         /* !< Command failed due to the use of an
                                                                                    illegal address */
#define FLASHCTL_STATCMD_FAILILLADDR_STATNOFAIL  ((uint32_t)0x00000000U)         /* !< No Fail */
#define FLASHCTL_STATCMD_FAILILLADDR_STATFAIL    ((uint32_t)0x00000040U)         /* !< Fail */
/* FLASHCTL_STATCMD[FAILMODE] Bits */
#define FLASHCTL_STATCMD_FAILMODE_OFS            (7)                             /* !< FAILMODE Offset */
#define FLASHCTL_STATCMD_FAILMODE_MASK           ((uint32_t)0x00000080U)         /* !< Command failed because a bank has
                                                                                    been set to a mode other than READ.
                                                                                    Program and Erase commands cannot be
                                                                                    initiated unless all banks are in
                                                                                    READ mode. */
#define FLASHCTL_STATCMD_FAILMODE_STATNOFAIL     ((uint32_t)0x00000000U)         /* !< No Fail */
#define FLASHCTL_STATCMD_FAILMODE_STATFAIL       ((uint32_t)0x00000080U)         /* !< Fail */
/* FLASHCTL_STATCMD[FAILINVDATA] Bits */
#define FLASHCTL_STATCMD_FAILINVDATA_OFS         (8)                             /* !< FAILINVDATA Offset */
#define FLASHCTL_STATCMD_FAILINVDATA_MASK        ((uint32_t)0x00000100U)         /* !< Program command failed because an
                                                                                    attempt was made to program a stored
                                                                                    0 value to a 1. */
#define FLASHCTL_STATCMD_FAILINVDATA_STATNOFAIL  ((uint32_t)0x00000000U)         /* !< No Fail */
#define FLASHCTL_STATCMD_FAILINVDATA_STATFAIL    ((uint32_t)0x00000100U)         /* !< Fail */

